sleemanj/ATTinyCore/avr/boards.txt
attinyx5opti.name=ATtiny45/85 (Optiboot)
attinyx5opti.upload.tool=avrdude
attinyx5opti.upload.protocol=arduino
attinyx5opti.upload.speed=19200
attinyx5opti.bootloader.tool=avrdude
attinyx5opti.bootloader.unlock_bits=0xFF
attinyx5opti.bootloader.lock_bits=0xFF
attinyx5opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx5opti.build.core=tiny
attinyx5opti.build.board=AVR_ATTINYX5
attinyx5opti.build.export_merged_output=false
attinyx5opti.bootloader.extended_fuses=0xFE
attinyx5opti.menu.LTO.enable=Enabled
attinyx5opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx5opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx5opti.menu.LTO.enable.ltocppflags=-flto
attinyx5opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx5opti.menu.LTO.disable=Disabled
attinyx5opti.menu.LTO.disable.ltocflags=
attinyx5opti.menu.LTO.disable.ltoelfflags=
attinyx5opti.menu.LTO.disable.ltocppflags=
attinyx5opti.menu.LTO.disable.ltoarcmd=
attinyx5opti.menu.TimerClockSource.default=CPU
attinyx5opti.menu.TimerClockSource.default.build.pllsettings=
attinyx5opti.menu.TimerClockSource.pll=64MHz
attinyx5opti.menu.TimerClockSource.pll.build.pllsettings=-DPLLTIMER1
attinyx5opti.menu.TimerClockSource.lowpll=32MHz
attinyx5opti.menu.TimerClockSource.lowpll.build.pllsettings=-DLOWPLLTIMER1
attinyx5opti.menu.chip.85=ATtiny85
attinyx5opti.menu.chip.85.build.mcu=attiny85
attinyx5opti.menu.chip.85.upload.maximum_size=7616
attinyx5opti.menu.chip.85.upload.maximum_data_size=512
attinyx5opti.menu.chip.45=ATtiny45
attinyx5opti.menu.chip.45.build.mcu=attiny45
attinyx5opti.menu.chip.45.upload.maximum_size=3520
attinyx5opti.menu.chip.45.upload.maximum_data_size=256
attinyx5opti.menu.clock.8internal=8 MHz (internal)
attinyx5opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx5opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx5opti.menu.clock.8internal.build.clocksource=0
attinyx5opti.menu.clock.16pll=16 MHz (PLL)
attinyx5opti.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx5opti.menu.clock.16pll.build.f_cpu=16000000L
attinyx5opti.menu.clock.16pll.build.clocksource=6
attinyx5opti.menu.clock.20external=20 MHz (external)
attinyx5opti.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.20external.build.f_cpu=20000000L
attinyx5opti.menu.clock.20external.build.clocksource=1
attinyx5opti.menu.clock.16external=16 MHz (external)
attinyx5opti.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.16external.build.f_cpu=16000000L
attinyx5opti.menu.clock.16external.build.clocksource=1
attinyx5opti.menu.clock.12external=12 MHz (external)
attinyx5opti.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.12external.build.f_cpu=12000000L
attinyx5opti.menu.clock.12external.build.clocksource=1
attinyx5opti.menu.clock.8external=8 MHz (external)
attinyx5opti.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.8external.build.f_cpu=8000000L
attinyx5opti.menu.clock.8external.build.clocksource=0
attinyx5opti.menu.clock.737external=7.372 MHz (external)
attinyx5opti.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx5opti.menu.clock.737external.build.f_cpu=7372800L
attinyx5opti.menu.clock.737external.build.clocksource=1
attinyx5opti.menu.clock.92external=9.216 MHz (external)
attinyx5opti.menu.clock.92external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.92external.build.f_cpu=9216000L
attinyx5opti.menu.clock.92external.build.clocksource=1
attinyx5opti.menu.clock.11external=11.0592 MHz (external)
attinyx5opti.menu.clock.11external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.11external.build.f_cpu=11059200L
attinyx5opti.menu.clock.11external.build.clocksource=1
attinyx5opti.menu.clock.14external=14.7456 MHz (external)
attinyx5opti.menu.clock.14external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.14external.build.f_cpu=14745600L
attinyx5opti.menu.clock.14external.build.clocksource=1
attinyx5opti.menu.clock.184external=18.432 MHz (external)
attinyx5opti.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.184external.build.f_cpu=18432000L
attinyx5opti.menu.clock.184external.build.clocksource=1
attinyx5opti.menu.clock.1internal=1 MHz (internal)
attinyx5opti.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx5opti.menu.clock.1internal.build.f_cpu=1000000L
attinyx5opti.menu.clock.1internal.build.clocksource=0
attinyx5opti.menu.clock.1internal.upload.speed=2400
attinyx5opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx5opti.menu.eesave.aenable=EEPROM retained
attinyx5opti.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx5opti.menu.eesave.disable=EEPROM not retained
attinyx5opti.menu.eesave.disable.bootloader.eesave_bit=1
attinyx5opti.menu.bod.disable=B.O.D. Disabled
attinyx5opti.menu.bod.disable.bootloader.bod_bits=111
attinyx5opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx5opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx5opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx5opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx5opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx5opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx5opti.build.variant=tinyX5
attinyx5opti.menu.millis.enabled=Enabled
attinyx5opti.menu.millis.disabled=Disabled (saves flash)
attinyx5opti.menu.millis.enabled.build.millis=
attinyx5opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx5opti.build.extra_flags={build.millis} -DNEOPIXELPORT=PORTB {build.pllsettings}


attinyx5micr.name=ATtiny85 (Micronucleus / DigiSpark)
attinyx5micr.upload.tool=micronucleus
attinyx5micr.upload.protocol=usb
attinyx5micr.upload.speed=19200
attinyx5micr.bootloader.tool=avrdude
attinyx5micr.build.mcu=attiny85
attinyx5micr.upload.maximum_size=6604
attinyx5micr.upload.maximum_data_size=512
attinyx5micr.bootloader.unlock_bits=0xFF
attinyx5micr.bootloader.lock_bits=0xFF
attinyx5micr.bootloader.file=empty/empty_all.hex
attinyx5micr.build.core=tiny
attinyx5micr.build.board=AVR_ATTINYX5
attinyx5micr.build.export_merged_output=false
attinyx5micr.bootloader.extended_fuses=0xFE
attinyx5micr.menu.LTO.enable=Enabled
attinyx5micr.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx5micr.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx5micr.menu.LTO.enable.ltocppflags=-flto
attinyx5micr.menu.LTO.enable.ltoarcmd=gcc-
attinyx5micr.menu.LTO.disable=Disabled
attinyx5micr.menu.LTO.disable.ltocflags=
attinyx5micr.menu.LTO.disable.ltoelfflags=
attinyx5micr.menu.LTO.disable.ltocppflags=
attinyx5micr.menu.LTO.disable.ltoarcmd=
attinyx5micr.build.pllsettings=
attinyx5micr.bootloader.low_fuses=0xE1
attinyx5micr.build.f_cpu=16500000L
attinyx5micr.build.clocksource=6
attinyx5micr.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx5micr.menu.eesave.aenable=EEPROM retained
attinyx5micr.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx5micr.menu.eesave.disable=EEPROM not retained
attinyx5micr.menu.eesave.disable.bootloader.eesave_bit=1
attinyx5micr.bootloader.bod_bits=111
attinyx5micr.build.variant=tinyX5
attinyx5micr.menu.millis.enabled=Enabled
attinyx5micr.menu.millis.disabled=Disabled (saves flash)
attinyx5micr.menu.millis.enabled.build.millis=
attinyx5micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx5micr.build.extra_flags={build.millis} -DNEOPIXELPORT=PORTB {build.pllsettings}


attinyx8.name=ATtiny48/88
attinyx8.upload.tool=avrdude
attinyx8.build.board=AVR_ATTINYX8
attinyx8.bootloader.tool=avrdude
attinyx8.bootloader.unlock_bits=0xFF
attinyx8.bootloader.lock_bits=0xFF
attinyx8.build.core=tiny
attinyx8.build.export_merged_output=false
attinyx8.menu.LTO.enable=Enabled
attinyx8.menu.LTO.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attinyx8.menu.LTO.enable.ltoelfflags=-flto -DLTO_ENABLED -fuse-linker-plugin
attinyx8.menu.LTO.enable.ltocppflags=-flto -DLTO_ENABLED
attinyx8.menu.LTO.enable.ltoarcmd=gcc-
attinyx8.menu.LTO.disable=Disabled
attinyx8.menu.LTO.disable.ltocflags=
attinyx8.menu.LTO.disable.ltoelfflags=
attinyx8.menu.LTO.disable.ltocppflags=
attinyx8.menu.LTO.disable.ltoarcmd=
attinyx8.menu.chip.88=ATtiny88
attinyx8.menu.chip.88.build.mcu=attiny88
attinyx8.menu.chip.88.upload.maximum_size=8192
attinyx8.menu.chip.88.upload.maximum_data_size=512
attinyx8.menu.chip.48=ATtiny48
attinyx8.menu.chip.48.build.mcu=attiny48
attinyx8.menu.chip.48.upload.maximum_size=4096
attinyx8.menu.chip.48.upload.maximum_data_size=256
attinyx8.bootloader.extended_fuses=0xff
attinyx8.bootloader.file=empty/empty_all.hex
attinyx8.menu.clock.8internal=8 MHz (internal)
attinyx8.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx8.menu.clock.8internal.build.f_cpu=8000000L
attinyx8.menu.clock.8internal.build.clocksource=0
attinyx8.menu.clock.1internal=1 MHz (internal)
attinyx8.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.1internal.build.f_cpu=1000000L
attinyx8.menu.clock.1internal.build.clocksource=0
attinyx8.menu.clock.4internal=4 MHz (internal)
attinyx8.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.4internal.build.f_cpu=4000000L
attinyx8.menu.clock.4internal.build.clocksource=0
attinyx8.menu.clock.128internal=128 kHz (internal WDT)
attinyx8.menu.clock.128internal.bootloader.low_fuses=0xC3
attinyx8.menu.clock.128internal.build.f_cpu=128000L
attinyx8.menu.clock.128external.build.clocksource=3
attinyx8.menu.clock.8external=8 MHz (external CLOCK - Danger: see docs!)
attinyx8.menu.clock.8external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.8external.build.f_cpu=8000000L
attinyx8.menu.clock.8external.build.clocksource=2
attinyx8.menu.clock.12external=12 MHz (external CLOCK - Danger: see docs!)
attinyx8.menu.clock.12external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.12external.build.f_cpu=12000000L
attinyx8.menu.clock.12external.build.clocksource=2
attinyx8.menu.clock.16external=16 MHz (external CLOCK, overclocked - Danger: see docs!)
attinyx8.menu.clock.16external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.16external.build.f_cpu=16000000L
attinyx8.menu.clock.16external.build.clocksource=2
attinyx8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx8.menu.eesave.aenable=EEPROM retained
attinyx8.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx8.menu.eesave.disable=EEPROM not retained
attinyx8.menu.eesave.disable.bootloader.eesave_bit=1
attinyx8.menu.bod.disable=B.O.D. Disabled
attinyx8.menu.bod.disable.bootloader.bod_bits=111
attinyx8.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8.menu.bod.1v8.bootloader.bod_bits=110
attinyx8.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8.menu.bod.2v7.bootloader.bod_bits=101
attinyx8.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8.menu.bod.4v3.bootloader.bod_bits=100
attinyx8.build.variant=tinyX8
attinyx8.menu.millis.enabled=Enabled
attinyx8.menu.millis.disabled=Disabled (saves flash)
attinyx8.menu.millis.enabled.build.millis=
attinyx8.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8.menu.neopixelport.porta=Port A (pins 23~26)
attinyx8.menu.neopixelport.portb=Port B (pins 16~22,27)
attinyx8.menu.neopixelport.portc=Port C (pins 9~13)
attinyx8.menu.neopixelport.portd=Port D (pins 0~7)
attinyx8.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx8.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx8.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attinyx8.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx8.build.extra_flags={build.millis} {build.neopixelport}


